Was she the reason he was alive today?
Catching the train to Long Island, a rush-hour interlude and more reader tales of New York City in this week’s Metropolitan Diary.
World’s Big Sleep Out, drawing attention to homelessness, happened in New York, London and other cities.
Representative Alexandria Ocasio-Cortez and other critics of an earlier proposal said a move to add offices in Manhattan proved them right.
The new leader of the Working Families Party in New York hopes to remake the progressive group to attract the energized left.
Multiple police officers in Brooklyn say they were told by a commander that white and Asian people should be left alone.
“It’s horrific,” said a vice president at Rowan University in New Jersey.
Darnell, 8, lives in a shelter in Queens. Sandivel, 10, shares a bedroom with her mother and four brothers in Brooklyn.
Anthony Comello is obsessed with conspiracy theories. His paranoia is being litigated in a Staten Island court.
Cheslie Kryst lives with Miss Universe in Manhattan. Soon, she will compete for her roommate’s crown.
LinkNYC was supposed to digitally unite the city, but the neighborhoods that need it the most have been left out.
“We are not anti-Semites,” said the former supervisor of Chester, N.Y., responding to a suit filed by New York’s attorney general.
A former whiz kid in Lindsay’s City Hall, he became a knows-everybody “process broker” with wide reach in civic affairs, broadcasting and real estate.
He bribed a government employee in 1994 so that he could obtain a fake ID for the singer Aaliyah, a person familiar with the matter said.
The push for quick deliveries from internet retailers has worsened gridlock and pollution. Packages are also luring thieves.
A 14-year-old was among the casualties this year in a Queens neighborhood ravaged by gun violence.
Ferraris. Villas on the French Riviera. Tax fraud. No one embodies the  spectacular collapse of New York’s taxi industry more than Gene Freidman. 
His cooperation with the government led hip-hop fans and other rappers to call him a snitch and a fraud.
Nicholas Feliciano, 18, had a history of suicide attempts, but Rikers jail guards failed to act for seven minutes when he tried to kill himself.
The mayor of New York City signed a bill Wednesday that transfers control of the nation’s largest public burial ground from the city corrections department to the parks department.
Bishop Richard J. Malone “had become the lightning rod for all that was wrong,” a lay leader said.
After Carol Schultz planted the tree, she would tell it, “Someday you’re going to be there." And now it is.
New York will allow Amazon, DHL and UPS to park cargo bikes in commercial loading zones as a way to get some trucks off the city’s gridlocked streets.
A man from Lebanon believed he would get leniency for providing information to the F.B.I. Instead, he was arrested on terrorism charges.
There’s an art to comedy, and an art to selling tickets to comedy. This is a story about selling the tickets.
Four Rikers officers have been suspended as investigators examine their failure to stop an 18-year-old detainee’s suicide attempt.
The apartment of a formerly homeless woman was so cold the dog’s water bowl froze. Raw sewage seeped into the basement of another woman’s.
Farmers in New York have taken drastic measures to protect their crops from trespassers and authorities who think they’re targeting marijuana.
It was wet and cold in the city, but the snow mostly didn’t stick.
Legislation was introduced after the rapper said he subjects his daughter to a yearly hymen exam, sparking outrage on social media.
Prosecutors expect to expand an indictment against two Soviet-born men whom Rudolph W. Giuliani enlisted to pressure Ukraine on President Trump’s behalf.
More than 300 students at the selective public high school, one of New York City’s most prestigious, protested its admissions policies.
Package theft has also soared in cities like Denver and Washington. The increase has frustrated shoppers and led to creative measures for thwarting thieves.
The city was expected to get up around four inches of snow, with greater amounts predicted for parts of New Jersey, Connecticut and southeast New York.
A crew of thieves struck at least nine times in the last three months, netting about $39,000 in ill-gotten gains.
An alleged leak to Mr. Cuomo, a phone call from a top legislative aide and a prolonged investigation are at the heart of Albany’s latest ethics dispute.
The city has changed drastically over the past 40 years, yet the M.T.A. map designed in 1979 has largely endured.
A self-styled “disruptive technologist” was arrested after speaking at a conference in Pyongyang on using digital currencies to launder money.
New Yorkers preparing to lumber back to work after an extended Thanksgiving weekend face an assault of plummeting temperatures, precipitation and heavy winds.
The morning commute will be cold and rainy, with snow beginning later as temperatures drop.
Paying with cash, wondering what a subway rider is studying and more reader tales of New York City in this week’s Metropolitan Diary.
A blocked pipe caused sewage to back up several feet deep in homes in a Queens neighborhood as officials looked at a familiar culprit on the heels of Thanksgiving.
“The concern is those acts of hate are the embers and then they begin to get radicalized,” an official said.
How the industry that ruled the city plans to rebound after a rough year.
From Wisconsin to New York, RJ the Magician has followed the showman’s path. He now directs the Houdini Museum of New York.
Home alone with infant twins, it’s all a blur. But at night, the husband comes home. He’s cooking.
At 8:12 a.m., the police department gave the all clear for the big character balloons that have made the event so famous.
There would be no herbs, or diffusers, or mysticism. There would be Oxycodone or Vicodin, and I would need to take it.
New York City is undergoing a surprising industrial transformation.
A gunman fired into a crowd on a block with stores, a day care center and students heading to after-school classes.
“They want to be loved,” said the founder of Chiz’s Heart Street, a group home where residents cook and celebrate together.
The companies, including Johnson & Johnson and McKesson Corporation, received subpoenas from Brooklyn prosecutors.
A Brooklyn man was arrested Wednesday on charges that he tried to help the Islamic State group, in part by encouraging attacks on New York’s subway system.
The president’s private lawyer explored agreements with Ukrainian officials for hundreds of thousands of dollars.
The famous giant balloons haven't been canceled since 1971. That could change this year. 
How a protest by students of color at Syracuse University — #NotAgainSU — electrified the campus and gained national attention.
The aging owners of a Catskills farm say it “has to close so we can survive.”
A posting of a video of the meal on TikTok garnered more than 152,000 likes.
The shopping district has empty stores. Short term, this means more window displays. Long term? Hmm.
Winds could ground the giant balloons as officials hope to prevent a repeat of 1997, when a woman was seriously injured.
He was quick recently to apologize for his "stop-and-frisk" policy, but such lingering controversies could affect his campaign. 
The front-runners for the presidential nomination are moving away from the charter school movement, and black and Latino families ask why their concerns are lost.
With another development planned at the site of a baseball stadium, local officials are trying to achieve revitalization without gentrification.
The move, which takes aim at the Working Families Party, was met by angry responses when announced. “Shame!” one person shouted.
“Why didn’t Mr. Epstein have a cellmate at the time that this happened?” a defense lawyer said.
“I’ve never seen this particular line this bad,” a man said. The fleet between New Jersey and New York City carries 32,000 riders daily.
The utility ended its moratorium on hookups after Gov. Andrew Cuomo threatened to pull its license.
Plans for a pedestrian zone around Rockefeller Center and Radio City Music Hall during the holidays might be good for shoppers but not so much for bus commuters.
A poll showed Lara Trump, the president’s daughter-in-law, would win a primary for a Long Island congressional seat by more than 30 points.
Officials had deemed the threat not credible, but the governor released a statement calling for increased police presence.
In search of “Aladdin Sane,” a windy walk to a coffee date and more reader tales of New York City in this week’s Metropolitan Diary.
Stephanie Parze disappeared three weeks ago in New Jersey. John Ozbilgen was accused of assaulting her in September.
A New Jersey woman was found guilty of vehicular homicide by a jury that weighed whether her actions were on par with drunken driving.
The fatal fire brought renewed attention to the worsening homeless crisis in New York City.
Mayor Bill de Blasio announced a plan to provide more pedestrian space to ease congestion on Fifth Avenue during the holidays.
Attorney General William P. Barr acknowledged his own initial suspicion that Jeffrey Epstein may have been murdered but said the evidence ultimately showed the financier hanged himself.
“Get rid of it right now,” an inspector barked when he saw a dangerous power tool. With injuries soaring, the city is tightening oversight.
"I agreed to drop it, reluctantly," said the man who wanted to build a bridge for pedestrians and cyclists from Manhattan to Hoboken or Jersey City.
Move over, Smorgasburg. The Bronx Night Market is drawing thousands on the weekends and producing winter events.
Far from the Trump White House, the actress and entrepreneur is pursuing a more spiritual path in Manhattan.
An arrest warrant from 2002 threatened to land Eric Barrier of Eric B. and Rakim behind bars.
“You will pay,” he said in messages for Representatives Steve Scalise and Cathy McMorris Rodgers, both prominent Republicans.
Nearly 50 people have died in recent months in the United States from vaping-related respiratory illnesses.
An investment banker, a dead handyman, a lethal dose of cocaine: The case has put the U.S. and Anguilla at odds.
The accident in Elizabeth comes just a few weeks after the city started a shared scooter program.
Bike and bus lanes have meant fewer spaces. Now, a panel in Manhattan has floated an idea that could make it even harder to find a spot for your car.
Inside a religious Haitian soiree in Brooklyn.
Next year, New York City buildings will be required to display their marks on energy efficiency.
When MyPayrollHR shut down, thousands of companies and a quarter of a million workers were left in the lurch.
Hundreds of New York State prisoners were locked in cells, denied release or removed from programs when tests erroneously showed they had used narcotics, according to a lawsuit.
The police said the attack was under investigation and declined to say whether they believed it was a hate crime.
Car culture has already been changed by bike and bus lanes. A transportation panel in Manhattan has floated the idea of eliminating free street parking entirely.
An indictment against two guards laid out an official narrative of what happened at the Metropolitan Correctional Center in Manhattan.
Pizza Rat is not the only resourceful city critter. A look at the endlessly entertaining (and slightly dangerous) world of urban wildlife.
Congresswoman Ilhan Omar asked for leniency in sentencing the western New York man.
Gov. Andrew Cuomo called for an outside monitor after a series of racist incidents that has left Syracuse University besieged.
The payout “doesn’t settle what I went through,” said Derrick Hamilton, who accused the police of fabricating evidence.
The two jail staff members were charged with falsifying records and conspiring to defraud the United States.
An upstate Republican and a Hudson Valley Democrat play roles in the Washington hearings.  
The number of homeless students has swelled by 70 percent over the past decade. For Darnell and Sandy, school is the only stable place they know.
